# GetConstraints Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarShapeSegment..::..GetConstraints Method
RebarShapeSegment Class See Also
---
Retrieve the list of constraints associated with this segment.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public IList<RebarShapeConstraint> GetConstraints()
```

Visual Basic
---
```text
Public Function GetConstraints As IList(Of RebarShapeConstraint)
```

Visual C++
---
```text
public:
IList<RebarShapeConstraint^>^ GetConstraints()
```

# ### Return Value
The list of constraints.
# See Also
RebarShapeSegment Class
Autodesk.Revit.DB.Structure Namespace